    [
      {
        "company": "CandleScience",
        "companyDescription": "is a wax and candle supply online shop based in North Carolina, USA.",
        "website": "https://www.candlescience.com/",
        "when": "02/2020 - 04/2020",
        "projects": [
          {
            "title": "Applying a new design for a running e-commerce",
            "description": "I helped CandleScience to implement a redesign from scratch. For long-term maintainability I introduced the concept of a small scale design system and self-contained components to establish a coherent user experience with low maintenance effort.",
            "tags": [
              "VueJS",
              "NuxtJS",
              "CircleCI",
              "Netlify",
              "SCSS",
              "Styleguide",
              "Component Library",
              "Responsive",
              "Accessible"
            ]
          }
        ]
      },
      {
        "company": "Fielmann",
        "companyDescription": "is a german eyewear company. They are the biggest in Europe and the market leader in Germany.",
        "website": "https://fielmann.de",
        "when": "08/2019 - 03/2020",
        "projects": [
          {
            "title": "Bridging the Gap between Design and Development",
            "description": "Fielmann already had a design system that was entirely focused on designers. I helped them to make the design system consumable for developers. This mainly included implementing the existing design patterns into code and distributing them in a different granularity. I was the Design Systems Team Lead.",
            "tags": [
              "ReactJS",
              "Styleguidist",
              "NodeJS",
              "CircleCI",
              "SCSS",
              "Component Library",
              "Semantic Versioning",
              "NPM",
              "Design System"
            ]
          },
          {
            "title": "Prototyping a Real time experience",
            "description": "As the only technical person in a design team I set up prototypes with novel technologies to resolve risks at an early stage and help to communicate with something tangible.",
            "tags": [
              "VueJS",
              "ReactJS",
              "Firebase",
              "Netlify",
              "Styled Components",
              "PWA",
              "GraphQL",
              "Rapid Prototyping",
              "OOUX"
            ]
          }
        ]
      },
      {
        "company": "Brandeins",
        "companyDescription": "is an independent business magazine with a monthly print issue.",
        "website": "https://brandeins.de",
        "when": "06/2019 - 10/2019",
        "projects": [
          {
            "title": "Implementing a mobile experience for a serious brand",
            "description": "I helped brandeins to implement their planned redesign to create a consistent responsive user experience. My job was to take an existing design from an agency and implement the frontend from scratch in VueJs. The challenging part was to orchestrate the redesign with tons of already existing content.",
            "tags": [
              "VueJS",
              "Responsive"
            ]
          }
        ]
      },
      {
        "company": "Cognitive Edge",
        "companyDescription": "is a complexity informed consultant and training Company.",
        "website": "https://cognitive-edge.com/",
        "when": "04/2019 - 12/2019",
        "projects": [
          {
            "title": "Cynefin® FOUNDATIONS online course",
            "description": "I often felt misplaced when running scrum on the inside but having a fixed scope and deadline on the outside. This plus an overconsumption of Dave Snowden videos on YouTube made me invest in an online course of Cognitive Edge. The lessons learned in this course stick with me ever since.",
            "tags": [
              "Complexity",
              "Coherence",
              "Constraints"
            ]
          }
        ]
      },
      {
        "company": "IFBHH",
        "companyDescription": "is the state development bank for Hamburg, Germany.",
        "website": "https://ifbhh.de",
        "when": "02/2019 - 04/2019",
        "projects": [
          {
            "title": "Scaffolding a project",
            "description": "I helped the agency cellular to implement an inhouse crafted redesign for the IFB. My job was to setup the initial skeleton of the website as well as integrating the most used UI components for later reuse by other developers.",
            "tags": [
              "ReactJS",
              "Typescript",
              "GraphQL"
            ]
          }
        ]
      },
      {
        "company": "A1",
        "companyDescription": "is a telecommunications corporation in Austria.",
        "website": "https://www.a1.net/",
        "when": "10/2018 - 12/2018",
        "projects": [
          {
            "title": "Using web technologies on a TV",
            "description": "A1 ships television boxes to their customer. My job was to implement a redesigned UI created by the agency cellular to run on their domestically distributed boxes.",
            "tags": [
              "SVN",
              "HTML",
              "CSS",
              "JS",
              "Perl"
            ]
          }
        ]
      },
      {
        "company": "Budnikowsky",
        "companyDescription": "is the fourth largest drug store chain in Germany.",
        "website": "https://www.budni.de/",
        "when": "07/2018 - 11/2018",
        "projects": [
          {
            "title": "Scaffold a new UI for retail",
            "description": "I helped the agency cellular to implement an in house crafted redesign for Budnikowsky. My job was to create the initial website skeleton and UI components that could display a wide range of products.",
            "tags": [
              "ReactJS",
              "Responsive",
              "Styleguide"
            ]
          }
        ]
      },
      {
        "company": "Boehringer Ingelheim",
        "companyDescription": "is one of the world's largest pharmaceutical companies.",
        "website": "https://www.boehringer-ingelheim.com/",
        "when": "06/2018 - 08/2018",
        "projects": [
          {
            "title": "Life with pulmonary fibrosis",
            "link": "https://www.lifewithpulmonaryfibrosis.com/",
            "description": "I helped the agency factorial to implement a design that was created by an external agency. My job was to implement the UI components that display the content which was created by a team of writers.",
            "tags": [
              "Drupal",
              "PHP",
              "HTML",
              "CSS"
            ]
          }
        ]
      },
      {
        "company": "sum.cumo",
        "companyDescription": "is a software development agency for insurances.",
        "website": "https://www.sumcumo.com/",
        "when": "01/2018 - 05/2018",
        "projects": [
          {
            "description": "I helped sum.cumo to establish a way of dissecting repetitive UI components to make them reusable and maintainable across client projects.",
            "tags": [
              "NuxtJS",
              "VueJS",
              "Styleguide"
            ]
          }
        ]
      },
      {
        "company": "Xing",
        "companyDescription": "is the german version of LinkedIn.",
        "website": "https://xing.com",
        "when": "06/2017 - 12/2017",
        "projects": [
          {
            "title": "Enable teams to self-administer data governance",
            "description": "I helped Xing to rapidly setup an internal tool for data governance administration to be able to comply with the european GDPR conditions.",
            "tags": [
              "ReactJS",
              "GraphQL"
            ]
          },
          {
            "title": "Discover and document a Design Language",
            "description": "I helped Xing to establish a comprehensive design system that went on to be used by more than 30 development teams. My job was to create components and to establish processes in the company that supported a shared language for UI components.",
            "tags": [
              "ReactJS",
              "Flow",
              "Jest",
              "PostCSS"
            ]
          }
        ]
      },
      {
        "company": "Jimdo",
        "companyDescription": "is a german website builder comparable to Wix/Squarespace.",
        "website": "https://www.jimdo.com/",
        "when": "2011 - 12/2016",
        "projects": [
          {
            "title": "Establish a UI-Library",
            "link": "http://jimdo.github.io/ui-library/#/",
            "description": "As part of a small informal group of people we managed to establish a UI component library to tackle the immense consistency problems Jimdo was struggling with. This felt great as it started as a grassroots project but ended up as something valuable and recognized throughout the whole company.",
            "tags": [
              "NodeJS",
              "Styleguide",
              "CircleCI",
              "ReactJS"
            ]
          },
          {
            "title": "Build templates and the template interaction interface",
            "description": "As part of the so-called template-team I built website templates but also the user-facing CMS interface to select and adjust a template as needed. I worked as a designer, frontend developer and partially product owner.",
            "tags": [
              "NodeJS",
              "ReactJS",
              "Heroku",
              "Sketch",
              "UnitTesting",
              "Usability Tests",
              "Product Management"
            ]
          },
          {
            "title": "Built intuitive WYSIWYG interfaces",
            "description": "The WYSIWYG CMS interface was a constant subject of support requests. My job was to design, implement, test and validate a more intuitive behavior.",
            "tags": [
              "Cucumber",
              "Jenkins",
              "HTML",
              "CSS"
            ]
          },
          {
            "title": "Conversion based Online marketing design",
            "description": "I started at the online marketing department of Jimdo where my job was to create landing pages based on SEA keywords in close cooperation with the marketing department.",
            "tags": [
              "Google Adwords",
              "Dreamweaver",
              "SCSS",
              "Photoshop",
              "Illustrator",
              "HTML"
            ]
          }
        ]
      }
    ]